Revit 2026 API

# BuiltInFailuresMEPSupportFailures Class

---

Failures about MEP suppor.

SystemObject Autodesk.Revit.DBBuiltInFailuresMEPSupportFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class MEPSupportFailures
```
```vb
Public NotInheritable Class MEPSupportFailures
```
```cpp
public ref class MEPSupportFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MEPSupportFailures = class end
```

The BuiltInFailuresMEPSupportFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotMatchInstanceSizeToHostError | The instance of [Symbol] cannot be re-sized to match the host. |
|  | InstanceOutOfHostError | The instance of [Symbol] lost its host and will be deleted. |
|  | InstanceProfileNotMatchWithHostError | The [Symbol]'s profile does not match the host. Instances of [Symbol] will be deleted. |
|  | TypeSizeNotMatchWithHostError | The [Symbol] does not match the size of the host. |

#### Reference

Autodesk.Revit.DB Namespace